
🏗️ Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.supernode[0].netbox_available_ip_address.management_ipv6 will be destroyed
  # (because netbox_available_ip_address.management_ipv6 is not in configuration)
  - resource "netbox_available_ip_address" "management_ipv6" {
      - description  = "Management Address dev-0" -> null
      - id           = "661" -> null
      - interface_id = 0 -> null
      - ip_address   = "2001:678:b7c:201::1/64" -> null
      - prefix_id    = 101 -> null
      - status       = "active" -> null
      - tags         = [] -> null
      - tenant_id    = 0 -> null
      - vrf_id       = 0 -> null
    }

  # module.supernode[0].netbox_interface.eth0 will be created
  + resource "netbox_interface" "eth0" {
      + enabled            = true
      + id                 = (known after apply)
      + mac_address        = "0E:E1:97:F8:CA:84"
      + name               = "eth0"
      + virtual_machine_id = (known after apply)
    }

  # module.supernode[0].netbox_ip_address.management_ipv6 will be created
  + resource "netbox_ip_address" "management_ipv6" {
      + description                  = "Management Address dev-0"
      + id                           = (known after apply)
      + ip_address                   = "2001:678:b7c:201:ce1:97ff:fef8:ca84/64"
      + nat_outside_addresses        = (known after apply)
      + status                       = "slaac"
      + virtual_machine_interface_id = (known after apply)
    }

  # module.supernode[0].netbox_primary_ip.supernode will be created
  + resource "netbox_primary_ip" "supernode" {
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 6
      + virtual_machine_id = (known after apply)
    }

  # module.supernode[0].netbox_virtual_machine.supernode will be created
  + resource "netbox_virtual_machine" "supernode" {
      + cluster_id   = 1
      + disk_size_gb = 4
      + id           = (known after apply)
      + memory_mb    = 1024
      + name         = "supernode-dev-0"
      + primary_ipv4 = (known after apply)
      + primary_ipv6 = (known after apply)
      + role_id      = 48
      + status       = "staged"
      + vcpus        = 2
    }

  # module.supernode[1].netbox_available_ip_address.management_ipv6 will be destroyed
  # (because netbox_available_ip_address.management_ipv6 is not in configuration)
  - resource "netbox_available_ip_address" "management_ipv6" {
      - description  = "Management Address dev-1" -> null
      - id           = "662" -> null
      - interface_id = 0 -> null
      - ip_address   = "2001:678:b7c:201::4/64" -> null
      - prefix_id    = 101 -> null
      - status       = "active" -> null
      - tags         = [] -> null
      - tenant_id    = 0 -> null
      - vrf_id       = 0 -> null
    }

  # module.supernode[1].netbox_interface.eth0 will be created
  + resource "netbox_interface" "eth0" {
      + enabled            = true
      + id                 = (known after apply)
      + mac_address        = "7A:0F:0B:DA:03:F9"
      + name               = "eth0"
      + virtual_machine_id = (known after apply)
    }

  # module.supernode[1].netbox_ip_address.management_ipv6 will be created
  + resource "netbox_ip_address" "management_ipv6" {
      + description                  = "Management Address dev-1"
      + id                           = (known after apply)
      + ip_address                   = "2001:678:b7c:201:780f:bff:feda:3f9/64"
      + nat_outside_addresses        = (known after apply)
      + status                       = "slaac"
      + virtual_machine_interface_id = (known after apply)
    }

  # module.supernode[1].netbox_primary_ip.supernode will be created
  + resource "netbox_primary_ip" "supernode" {
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 6
      + virtual_machine_id = (known after apply)
    }

  # module.supernode[1].netbox_virtual_machine.supernode will be created
  + resource "netbox_virtual_machine" "supernode" {
      + cluster_id   = 1
      + disk_size_gb = 4
      + id           = (known after apply)
      + memory_mb    = 1024
      + name         = "supernode-dev-1"
      + primary_ipv4 = (known after apply)
      + primary_ipv6 = (known after apply)
      + role_id      = 48
      + status       = "staged"
      + vcpus        = 2
    }

Plan: 8 to add, 0 to change, 2 to destroy.
```